function boxplot5(x0,y0,z0)
x = x0 + [
    0 1 1 0 0 0;
    1 1 0 0 1 1;
    1 1 0 0 1 1;
    0 1 1 0 0 0];
y = y0 + [
    0 0 1 0 0 0;
    0 1 1 1 0 0;
    0 1 1 1 1 1;
    0 0 1 0 1 1];
z = z0 + [
    0 0 0 0 0 1;
    0 0 0 0 0 1;
    1 1 1 1 0 1;
    1 1 1 1 0 1];
c = cool( 110 );   %%%%-------hsv( ),注意括号里面的数字要比w()里相应的数字要大才可以！！
fill3(x,y,z,c(x0,:));
colormap( cool );   %%%%-----优化前用winter,优化后用cool
hold on
end

%%%%%-----colormap(hsv(n));mmap( ‘y’ )是一个黄色颜色映象
%%%%%-----mmap([.49  1  .83])是一个水色的颜色映象
%%%%%-----mmap( ‘c’ ,20)是一个长度为20的青蓝色的颜色映象
%%%%%-----应用：colormap(mmap(c,m));
%%%%%-----jet（色彩饱和值，以蓝色开始和结束）;hsv（色彩饱和值，以红色开始和结束）;hot（黑红黄白）;cool(青蓝和洋红的色度);flag(红白蓝黑);
%%%%---copper（铜色）;bone（带一点蓝色的灰度）;gray（线性灰度）;pink（粉红的彩色度）;
